{
  "name": "The Mana Concentrator",
  "icon": "manaweave_and_runes:novice_mana_concentrator",
  "category": "manaweave_and_runes:mana_concentration_category",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "A foundational tool in the art of arcane crafting, the Novice Mana Concentrator serves as the bridge between mundane materials and true magical constructs. By harnessing ambient mana, it infuses chosen items with arcane properties, allowing the creation of enchanted artifacts and components. $(2br)To operate it, one must carefully arrange the required items on the surrounding pedestals, then feed the concentrator with storage runes by right-clicking them into its core. A final touch of the Mana Weaver’s Wand initiates the infusion process, drawing in energy as the materials gradually dissolve, their essence woven into a new form. Upon completion, the crafted item is expelled atop the concentrator, imbued with the power it was designed to hold."
    },
    {
      "type": "patchouli:text",
      "text": "This device is forgiving—failure to provide the correct items or mana simply halts the process rather than invoking chaos. While limited in complexity, it remains an essential stepping stone in a weaver’s journey, granting access to tools and materials necessary for greater magical endeavors."
    },
    {
      "type": "patchouli:crafting",
      "recipe": "manaweave_and_runes:novice_mana_concentrator"
    },
    {
      "type": "patchouli:multiblock",
      "multiblock": {
        "mapping": {
          "R": "manaweave_and_runes:rune_block",
          "P": "manaweave_and_runes:rune_pedestal",
          "A": "minecraft:amethyst_block",
          "0": "manaweave_and_runes:novice_mana_concentrator"
        },
        "pattern": [
          [
            "       ",
            "       ",
            "       ",
            "       ",
            "       ",
            "       ",
            "       "
          ],
          [
            "       ",
            "       ",
            "  P P  ",
            "   0   ",
            "  P P  ",
            "       ",
            "       "
          ],
          [
            "__R_R__",
            "_R_R_R_",
            "R_ARA_R",
            "_RRARR_",
            "R_ARA_R",
            "_R_R_R_",
            "__R_R__"
          ]
        ],
        "symmetric": true
      }
    }
  ]
}